#Область ПрограммныйИнтерфейс

// Процедура "ОтправитьСообщениеВГруппуТелеграмм"
//
// Описание:
//   Данная процедура отправляет сообщение в группу Телеграмм с использованием
//   API Телеграмм-бота. 
//   Если сообщение не отправлено - вносит в  журнал регистрации информацию об ошибке.
//   
// Параметры:
//   СообщениеВТелеграмм - Строка
//   строка, содержащая текст сообщения, которое будет отправлено в группу.
// Возвращаемое значение:
//   - Число  
//   код состояния ответа сервера (200 - успех, другие - ошибки).
Функция ОтправитьСообщениеВГруппуТелеграмм(СообщениеВТелеграмм) Экспорт
		
	ТокенУправленияТелеграмБотом = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить(); // "7918837962:AAETWQf4HLtgJbLh0lbBYG58cVHhWwJ6ggI"; 
	ИдентификаторГруппыДляОповещения = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить(); // "-1002512859880";
	Ресурс = СтрШаблон("bot%1/sendMessage?chat_id=%2&text=%3", ТокенУправленияТелеграмБотом, ИдентификаторГруппыДляОповещения, СообщениеВТелеграмм);	
	Хост = "api.telegram.org";
	
	SSL = Новый ЗащищенноеСоединениеOpenSSL();
	HTTPСоединение = Новый HTTPСоединение(Хост,,,,,,SSL);
	HTTPЗапрос = Новый HTTPЗапрос(Ресурс);
	HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
	
	Если HTTPОтвет.КодСостояния <> 200 Тогда
		СтрокаHTTPОтвет = HTTPОтвет.ПолучитьТелоКакСтроку(); 
		ИмяСобытия = НСтр("ru = 'Сообщение в группу Телеграмм. Сообщение не отправлено'");
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, СтрокаHTTPОтвет);		
	КонецЕсли;
	
	КодСостояния = HTTPОтвет.КодСостояния;
	
	Возврат КодСостояния;

КонецФункции 

#КонецОбласти