//НачалоДоработки. Контеева, 01.05.24. Программное выведение на форму реквизитов договора обслуживания

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НовыйЭлемент = Элементы.Добавить("НачалоДействия", Тип("ПолеФормы"));
	НовыйЭлемент.ПутьКДанным    = "Объект.ВКМ_НачалоДействия"; 
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Начало действия";
	
	НовыйЭлемент = Элементы.Добавить("КонецДействия", Тип("ПолеФормы"));
	НовыйЭлемент.ПутьКДанным    = "Объект.ВКМ_КонецДействия"; 
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Конец действия";
	
	НовыйЭлемент = Элементы.Добавить("АбонентскаяПлата", Тип("ПолеФормы"));
	НовыйЭлемент.ПутьКДанным    = "Объект.ВКМ_АбонентскаяПлата"; 
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Абонентская плата";
	
	НовыйЭлемент = Элементы.Добавить("ЧасоваяСтавка", Тип("ПолеФормы"));
	НовыйЭлемент.ПутьКДанным    = "Объект.ВКМ_ЧасоваяСтавка"; 
	НовыйЭлемент.Вид            = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Часовая ставка";
	
	Если НЕ Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_Обслуживание Тогда  
		Элементы.НачалоДействия.Видимость = Ложь;  
		Элементы.КонецДействия.Видимость = Ложь;    
		Элементы.АбонентскаяПлата.Видимость = Ложь;    
		Элементы.ЧасоваяСтавка.Видимость = Ложь; 
	Иначе 	
		Элементы.НачалоДействия.Видимость = Истина;  
		Элементы.КонецДействия.Видимость = Истина;    
		Элементы.АбонентскаяПлата.Видимость = Истина;    
		Элементы.ЧасоваяСтавка.Видимость = Истина; 
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_Обслуживание 
	И Не ЗначениеЗаполнено(Объект.ВКМ_НачалоДействия) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не заполнена дата начала договора";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_Обслуживание 
		И Не ЗначениеЗаполнено(Объект.ВКМ_КонецДействия) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не заполнена дата окончания договора";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ВидДоговораПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	
	Если НЕ Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_Обслуживание Тогда  
		Элементы.НачалоДействия.Видимость = Ложь;  
		Элементы.КонецДействия.Видимость = Ложь;    
		Элементы.АбонентскаяПлата.Видимость = Ложь;    
		Элементы.ЧасоваяСтавка.Видимость = Ложь; 
	Иначе 	
		Элементы.НачалоДействия.Видимость = Истина;  
		Элементы.КонецДействия.Видимость = Истина;    
		Элементы.АбонентскаяПлата.Видимость = Истина;    
		Элементы.ЧасоваяСтавка.Видимость = Истина; 
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//КонецДоработки

