#Область СлужебныеПроцедурыИФункции
Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ФормаЭлемента" Тогда
		ДобавитьГруппуДаты(Форма);
		ДобавитьГруппуСтоимость(Форма);	  
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьКнопкуДляАвтозаполнения(Форма);		                
	КонецЕсли;
	
КонецПроцедуры 

Процедура ДобавитьГруппуДаты(Форма)
	
	ТекГруппа = Форма.Элементы.Добавить("ВКМ_ГруппаДляДат", Тип("ГруппаФормы"));
	ТекГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ТекГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	ТекГруппа.ОтображатьЗаголовок = Ложь; 
	ТекГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;   
	
	ПолеВвода = Форма.Элементы.Добавить("ВКМ_ДатаНачала", Тип("ПолеФормы"), ТекГруппа);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаНачала";   
	//ПолеВвода.УстановитьДействие("ПриИзменении", "...");
	
	ПолеВвода = Форма.Элементы.Добавить("ВКМ_ДатаОкончания", Тип("ПолеФормы"), ТекГруппа);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаОкончания"; 	
КонецПроцедуры

Процедура ДобавитьГруппуСтоимость(Форма)
	
	ТекГруппа = Форма.Элементы.Добавить("ВКМ_ГруппаДляСтоимости", Тип("ГруппаФормы"));
	ТекГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ТекГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	ТекГруппа.ОтображатьЗаголовок = Ложь; 
	ТекГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;   
	
	ПолеВвода = Форма.Элементы.Добавить("ВКМ_АбонентскаяПлата", Тип("ПолеФормы"), ТекГруппа);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";   
	
	ПолеВвода = Форма.Элементы.Добавить("ВКМ_Нормочас", Тип("ПолеФормы"), ТекГруппа);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_Нормочас"; 	
КонецПроцедуры

Процедура ДобавитьКнопкуДляАвтозаполнения(Форма)
	
    // Создадим команду
    Команда = Форма.Команды.Добавить("ВСМ_Заполнить");
    Команда.Действие	= "ВКМ_ЗаполнитьДанными";
    Команда.Подсказка   = "Автозаполнение документа";
    Команда.Картинка    = БиблиотекаКартинок.ПоказатьДанные;
    Команда.Отображение = ОтображениеКнопки.КартинкаИТекст;

    // Создадим кнопку и привяжем к ней команду
    Кнопка = Форма.Элементы.Добавить("ВКМ_ФормаЗаполнить", Тип("КнопкаФормы"), Форма.Элементы.ФормаКоманднаяПанель);
    Кнопка.Заголовок	= "Заполнить";
    Кнопка.ИмяКоманды	= "ВСМ_Заполнить";    

КонецПроцедуры

#КонецОбласти