
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВКМ_ГрафикОтпусков.Записывать = Истина;
		 
	Для Каждого Строка Из ОтпускаСотрудников Цикл
		Движение = Движения.ВКМ_ГрафикОтпусков.Добавить();
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.ДатаНачала = Строка.ДатаНачала;
		Движение.ДатаОкончания = Строка.ДатаОкончания;
			КоличествоДнейОтпуска = Строка.ДатаОкончания - Строка.ДатаНачала;
		Движение.КоличествоДней = КоличествоДнейОтпуска;
		Движение.Период = Дата; 
	КонецЦикла;
	
	Движения.Записать();
	
КонецПроцедуры
