#Область ПрограммныйИнтерфейс
// Заполняет описания поставляемых профилей групп доступа и
// переопределяет параметры обновления профилей и групп доступа.
//
// Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  ОписанияПрофилей - Массив из см. УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа,
//                               см. УправлениеДоступом.НовоеОписаниеПапкиПрофилейГруппДоступа
//  ПараметрыОбновления - Структура:
//   * ОбновлятьИзмененныеПрофили - Булево - начальное значение Истина.
//   * ЗапретитьИзменениеПрофилей - Булево - начальное значение Истина.
//       Если установить Ложь, тогда поставляемые профили можно не только просматривать, но и редактировать.
//   * ОбновлятьГруппыДоступа     - Булево - начальное значение Истина.
//   * ОбновлятьГруппыДоступаСУстаревшимиНастройками - Булево - начальное значение Ложь.
//       Если установить Истина, то настройки значений, выполненные администратором для
//       вида доступа, который был удален из профиля, будут также удалены из групп доступа.
//
// Пример:
//  ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
//  ОписаниеПрофиля.Имя           = "Менеджер";
//  ОписаниеПрофиля.Идентификатор = "75fa0ecb-98aa-11df-b54f-e0cb4ed5f655";
//  ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер по продажам'", ОбщегоНазначения.КодОсновногоЯзыка());
//  ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
//  ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
//  ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
//  ОписаниеПрофиля.Роли.Добавить("Подсистема_Продажи");
//  ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовПокупателей");
//  ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаКнигаПокупок");
//  ОписанияПрофилей.Добавить(ОписаниеПрофиля);
//
//  ОписаниеПапки = УправлениеДоступом.НовоеОписаниеПапкиПрофилейГруппДоступа();
//  ОписаниеПапки.Имя           = "ДополнительныеПрофили";
//  ОписаниеПапки.Идентификатор = "69a066e7-ce81-11eb-881c-b06ebfbf08c7";
//  ОписаниеПапки.Наименование  = НСтр("ru = 'Дополнительные профили'", ОбщегоНазначения.КодОсновногоЯзыка());
//  ОписанияПрофилей.Добавить(ОписаниеПапки);
//
//  ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
//  ОписаниеПрофиля.Родитель = "ДополнительныеПрофили";
//  ОписаниеПрофиля.Идентификатор = "70179f20-2315-11e6-9bff-d850e648b60c";
//  ОписаниеПрофиля.Наименование = НСтр("ru = 'Редактирование, отправка по почте, сохранение в файл печатных форм (дополнительно)'",
//  	ОбщегоНазначения.КодОсновногоЯзыка());
//  ОписаниеПрофиля.Описание = НСтр("ru = 'Дополнительно назначается пользователям, которым должна быть доступна возможность редактирования,
//  	|перед печатью, отправка по почте и сохранение в файл сформированных печатных форм.'");
//  ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
//  ОписанияПрофилей.Добавить(ОписаниеПрофиля);
//
//@skip-check module-structure-method-in-regions
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Менеджер по продажам";
	ОписаниеПрофиля.Идентификатор = "21c30ab2-3d82-4f54-be4c-d303b5f826ea";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер по продажам'", ОбщегоНазначения.КодОсновногоЯзыка());
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("БазоваяФункциональностьТП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовПродажи");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВзаиморасчетовСПокупателями");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНСИ");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Менеджер по закупкам";
	ОписаниеПрофиля.Идентификатор = "0ab577d8-fbac-45a9-b44f-7a0ca3c96d2c";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер по закупкам'", ОбщегоНазначения.КодОсновногоЯзыка());
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("БазоваяФункциональностьТП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовПокупки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВзаиморасчетовСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНСИ");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Главный бухгалтер";
	ОписаниеПрофиля.Идентификатор = "0f2150dc-9fcd-4dcd-a1be-e5fe363efa73";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Главный бухгалтер'", ОбщегоНазначения.КодОсновногоЯзыка());
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВариантовОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУчетныхЗаписейЭлектроннойПочты");
	ОписаниеПрофиля.Роли.Добавить("БазоваяФункциональностьТП");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовПокупки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовПродажи");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНСИ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзмененияДенежныхДокументов");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// {{ Доработка
	// Иконникова Е.Ю. 
	
	ОбщиеРоли = Новый Массив;
	ОбщиеРоли.Добавить("ЗапускВебКлиента");
	ОбщиеРоли.Добавить("ЗапускТонкогоКлиента");
	ОбщиеРоли.Добавить("БазовыеПраваБСП");
	ОбщиеРоли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОбщиеРоли.Добавить("ПросмотрСвязанныеДокументы");
	ОбщиеРоли.Добавить("СохранениеДанныхПользователя");
	ОбщиеРоли.Роли.Добавить("ЧтениеВариантовОтчетов");
	ОбщиеРоли.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОбщиеРоли.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОбщиеРоли.Добавить("ЧтениеУчетныхЗаписейЭлектроннойПочты");
	ОбщиеРоли.Добавить("БазоваяФункциональностьТП");
	ОбщиеРоли.Добавить("ВКМ_ПросмотрПодсистемы_ВКМ_РаботаСЗаявкамиКлиентов");
	ОбщиеРоли.Добавить("ВКМ_ЧтениеОбъектовПодсистемы_ВКМ_РаботаСЗаявкамиКлиентов");
	ОбщиеРоли.Добавить("ВКМ_ПросмотрПодсистемы_ВКМ_РасчетУправленческойЗарплаты");
	ОбщиеРоли.Добавить("ВКМ_ЧтениеОбъектовПодсистемы_ВКМ_РасчетУправленческойЗарплаты");
	
	// Добавление профиля Менеджер для работы с Заявками покупателей
	// роль ВКМ_ДобавлениеИзменениеДокументаОбслуживаниеКлиентов
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Менеджер по абонентскому обслуживанию";
	ОписаниеПрофиля.Идентификатор = "c7564f3b-9c9a-4107-be2f-24f9c09bb770";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер по абонентскому обслуживанию'", ОбщегоНазначения.КодОсновногоЯзыка());
	ДобавтьОбщиеРоли(ОписаниеПрофиля, ОбщиеРоли);
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовПродажи");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВзаиморасчетовСПокупателями");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНСИ");
	// роли для работы с обработкой ОтправкаСообщенийВТелеграмм и документом ОбслуживаниеКлиентов
	ОписаниеПрофиля.Роли.Добавить("ВКМ_ИспользованиеОбработки_ВКМ_ОтправкаСообщенийВТелеграммПоРасписанию");
	ОписаниеПрофиля.Роли.Добавить("ВКМ_ДобавлениеИзменениеДокумента_ВКМ_ОбслуживаниеКлиентов");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Добавление профиля Специалист для работы с Заявками покупателей
	// роль ВКМ_ДобавлениеИзменениеДокументаОбслуживаниеКлиентов
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Специалист по абонентскому обслуживанию";
	ОписаниеПрофиля.Идентификатор = "39e34ba4-4aaa-423a-a865-1e9621e347f4";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Специалист по абонентскому обслуживанию'", ОбщегоНазначения.КодОсновногоЯзыка());
	ДобавтьОбщиеРоли(ОписаниеПрофиля, ОбщиеРоли);
	// роли для работы с документом ОбслуживаниеКлиентов
	ОписаниеПрофиля.Роли.Добавить("ВКМ_ДобавлениеИзменениеДокумента_ВКМ_ОбслуживаниеКлиентов");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
	// Добавление профиля Бухгалтер, который осуществляет массовое создание документов Реализация 
	// роль ВКМ_ДобавлениеИзменениеДокументаОбслуживаниеКлиентов
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Бухгалтер ИТ фирмы";
	ОписаниеПрофиля.Идентификатор = "736cc039-1137-4c42-bc8f-5a0a95a1fa4b";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Бухгалтер ИТ фирмы'", ОбщегоНазначения.КодОсновногоЯзыка());
	ДобавтьОбщиеРоли(ОписаниеПрофиля, ОбщиеРоли);
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовПродажи");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзмененияДенежныхДокументов");
	// Роли для работы с обработкой МассовоеСозданиеАктов (создание реализации за прошедший период)	
	ОписаниеПрофиля.Роли.Добавить("ВКМ_ПросмотрПодсистемы_ВКМ_ОбслуживаниеКлиентов");
	ОписаниеПрофиля.Роли.Добавить("ВКМ_ИспользованиеОбработки_ВКМ_МассовоеСозданиеАктов");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
		
	// Добавление профиля КадровикРасчетчик, который осуществляет ввод информации о заработной плате, плановых отпусках 
	// роль ВКМ_ДобавлениеИзменениеДокументовПоПланированиюОтпусковИРасчетамПоЗарплате
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Кадровик - расчетчик";
	ОписаниеПрофиля.Идентификатор = "9e5dc6ec-2478-4f3e-9ce9-41e4a7be2c95";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Кадровик - расчетчик'", ОбщегоНазначения.КодОсновногоЯзыка());
	ДобавтьОбщиеРоли(ОписаниеПрофиля, ОбщиеРоли);
	// Роль для работы с вводом информации о заработной плате, плановых отпусках 	
	ОписаниеПрофиля.Роли.Добавить("ВКМ_ДобавлениеИзменениеДокументовПоПланированиюОтпусковИРасчетамПоЗарплате");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
					
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавтьОбщиеРоли(ОписаниеПрофиля, ОбщиеРоли)

	Для Каждого Роль Из ОбщиеРоли Цикл
		ОписаниеПрофиля.Роли.Добавть(Роль);
	КонецЦикла

КонецПроцедуры

#КонецОбласти

	// Конец доработки }}