
#Область СлужебныеПроцедурыИФункции

Процедура ОтправкаВТГ() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_УведомленияТГБоту.Ссылка КАК Ссылка,
	|	ВКМ_УведомленияТГБоту.ТекстСообщения КАК ТекстСообщения
	|ИЗ
	|	Справочник.ВКМ_УведомленияТГБоту КАК ВКМ_УведомленияТГБоту";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ТекстСообщения = Выборка.ТекстСообщения;
		Соединение = Истина; 
		ОтправитьСообщение(ТекстСообщения,Соединение);
		//ЭТО ХЗ
		ВыбратьОбъект = Выборка.ПолучитьОбъект();
		ВыбратьОбъект.Удалить();
		
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ОтправитьСообщение(ТекстСообщения, Соединение) Экспорт
	
	Соединение = Новый HTTPСоединение("api.telegram.org",443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	
	
	Токен = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить();
	ИдентификаторГруппы = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();
	
	Ресурс = "bot"+Токен+"/sendMessage?chat_id="+ИдентификаторГруппы+"&text="+ТекстСообщения;
	
	ЗапросТГ = Новый HTTPЗапрос(Ресурс);
	ЗапросТГ.Заголовки.Вставить("Content-Type", ТипКонтентаJSON());
	Ответ = Соединение.Получить(ЗапросТГ);
	
	
	Если Ответ.КодСостояния <> 200 Тогда
	
	ДанныеОбОшибке = Ответ.ПолучитьТелоКакСтроку();
	ЗаписьЖурналаРегистрации("HTTPСервисы.Ошибка", УровеньЖурналаРегистрации.Ошибка,,,
              ДанныеОбОшибке,);  
	   Соединение = Ложь; 
    КонецЕсли;   
	
	ЗаписьЖурналаРегистрации("HTTPСервисы.Отправка", УровеньЖурналаРегистрации.Информация,,,
	           "Сообщение отправлено",);
	
	
КонецПроцедуры

Функция ТипКонтентаJSON() Экспорт
	
	Возврат "aplication/json";
	
КонецФункции

Процедура ВКМ_ОтправкаВТГ() Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти




