#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Год = ОбщегоНазначенияКлиентСервер.СтрокаВДату(Параметры.Год);   
	ПрочитатьДанныеИзВременногоХранилищаНаСервере(Параметры.АдресВХ)
	
КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьДанныеИзВременногоХранилищаНаСервере(Адрес)
	ТаблицаЗначенийОтпускаСотрудников = ПолучитьИзВременногоХранилища(Адрес);
	Для каждого Стр Из ТаблицаЗначенийОтпускаСотрудников Цикл  
		
		Точка = Диаграмма.УстановитьТочку(Стр.Сотрудник);
		Серия = Диаграмма.УстановитьСерию("Отпуск");    // 
		
		        Серия.Цвет = WEBЦвета.Бирюзовый;
			Серия.Текст = "Отпуск";
			
		Значение = Диаграмма.ПолучитьЗначение(Точка,Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Стр.ДатаНачала;
		Интервал.Конец = Стр.ДатаОкончания;
 
	КонецЦикла; 
КонецПроцедуры

#КонецОбласти

