
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ОтпускаСотрудников = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	//ВКМ_ДиаграммаГанта.УстановитьПолныйИнтервал(НачалоГода(Дата), КонецГода(Дата));
	
	Для Каждого Строка Из ОтпускаСотрудников Цикл  
		
		Точка = ВКМ_ДиаграммаГанта.УстановитьТочку(Строка.ВКМ_Сотрудник);
		Серия = ВКМ_ДиаграммаГанта.УстановитьСерию("Отпуск");
		
		Значение = ВКМ_ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ВКМ_ДатаНачала;
		Интервал.Конец = Строка.ВКМ_ДатаОкончания;	
		
	КонецЦикла; 

КонецПроцедуры

#КонецОбласти
