
&НаКлиенте
Процедура СоздатьРеализации(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Период) Тогда 
		Сообщить("Не заполнен период"); 
		Возврат; 
	КонецЕсли;
	
	
	// --> алгоритм должен выполняться с использованием механизма длительных операций БСП
	ПараметрыВыполнения = Новый Структура;
	ЛогЗагрузки = ""; 
	
	ПараметрыЗапуска = Новый Структура("ПараметрыВыполнения", ПараметрыВыполнения); 	
	
	СтруктураФоновогоЗадания = СоздатьРеализацииНаСервере(ПараметрыЗапуска, УникальныйИдентификатор);
	ИДЗадания 	= СтруктураФоновогоЗадания.ИдентификаторЗадания;
	ИдентификаторЗадания = СтруктураФоновогоЗадания.ИдентификаторЗадания; 
	
	ПараметрыОжидания  = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	ПараметрыОжидания.Интервал 	= 1;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(СтруктураФоновогоЗадания, Новый ОписаниеОповещения("ОбработатьДанные", ЭтотОбъект, ЛогЗагрузки), ПараметрыОжидания);
	// <--
	
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДоговорыКонтрагентов = ПолучитьДоговорыКонтрагентов();
	
	Если ДоговорыКонтрагентов.Количество() > 0 Тогда 
		Для Каждого Договор Из ДоговорыКонтрагентов Цикл
			НоваяСтрока = Объект.Данные.Добавить(); 
			НоваяСтрока.Договор = Договор; 
		КонецЦикла; 
	КонецЕсли;
	
КонецПроцедуры 

Функция ПолучитьДоговорыКонтрагентов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	НЕ ДоговорыКонтрагентов.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	МассивДоговоров = Новый Массив; 
	
	Пока Выборка.Следующий() Цикл
		МассивДоговоров.Добавить(Выборка.Ссылка);
	КонецЦикла;  
	
	Возврат МассивДоговоров; 	
	
КонецФункции

Функция СоздатьРеализацииНаСервере(ПараметрыЗапуска, УникальныйИдентификатор)
		
	НаименованиеЗадания = "Запуск длительной операции";
	ВыполняемыйМетод = "ВКМ_ДлительныеОперации.СозданиеРеализаций";
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	
	// для отладки
	//ПараметрыВыполнения.ЗапуститьВФоне   = Ложь;
	//ПараметрыВыполнения.ЗапуститьНеВФоне = Истина;
		МассивДанных = Новый Массив; 
	СтруктураРеквизитов = Новый Структура("Период", Объект.Период); 
	МассивДанных.Добавить(СтруктураРеквизитов);
	ТЗ = Объект.Данные.Выгрузить();
	МассивСтруктур = ТаблицаЗначенийВМассив(ТЗ);
	МассивДанных.Добавить(МассивСтруктур); 
	
	ПараметрыЗапуска.Вставить("ДанныеОбъекта", МассивДанных); 
	
	СтруктураФоновогоЗадания = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ВыполняемыйМетод, ПараметрыЗапуска.ПараметрыВыполнения, ПараметрыЗапуска.ДанныеОбъекта);
		
	Возврат СтруктураФоновогоЗадания;
	
КонецФункции  

&НаКлиенте
Процедура ОбработатьДанные(Результат, ЛогЗагрузки) Экспорт
	
	ЗаполнитьРеализацииНаСервере(); 
	а=1;
	
КонецПроцедуры

Функция ТаблицаЗначенийВМассив(ТаблицаЗначений) Экспорт
    
    Массив = Новый Массив();
    СтруктураСтрокой = "";
    НужнаЗапятая = Ложь;
    Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
        Если НужнаЗапятая Тогда
            СтруктураСтрокой = СтруктураСтрокой + ",";
        КонецЕсли;
        СтруктураСтрокой = СтруктураСтрокой + Колонка.Имя;
        НужнаЗапятая = Истина;
    КонецЦикла;
    Для Каждого Строка Из ТаблицаЗначений Цикл
        НоваяСтрока = Новый Структура(СтруктураСтрокой);
        ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
        Массив.Добавить(НоваяСтрока);
    КонецЦикла;
    Возврат Массив;

КонецФункции

Процедура ЗаполнитьРеализацииНаСервере() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	РеализацияТоваровУслуг.Ссылка КАК Реализация
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ПО РеализацияТоваровУслуг.Договор = ДоговорыКонтрагентов.Ссылка
		|ГДЕ
		|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
		|	И РеализацияТоваровУслуг.Дата = &Дата";
	
	Запрос.УстановитьПараметр("Дата", Объект.Период); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ТЗ = Новый ТаблицаЗначений; 
	ТЗ.Колонки.Добавить("Договор"); 
	ТЗ.Колонки.Добавить("Реализация"); 
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ТЗ.Добавить();
		НоваяСтрока.Договор = Выборка.Договор; 
		НоваяСтрока.Реализация = Выборка.Реализация;
	КонецЦикла;  
	
	Для Каждого Строка Из Объект.Данные Цикл
		СтрокаТЗ = ТЗ.Найти(Строка.Договор);
		Строка.Реализация = СтрокаТЗ.Реализация; 
	КонецЦикла; 
		
КонецПроцедуры

