#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Функция КонтрольЗаполненияФОрмы()
	Если Не ЗначениеЗаполнено(Объект.МесяцОтчета) Тогда
		Возврат Ложь;
		ОбщегоНазначения.СообщитьПользователю("Поле ""Месяц Отчета "" не заполнен");
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы //<ИмяТаблицыФормы>

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура СоздатьАктыОбОказанииУслуг(Команда)
	Ответ = Ждать ВопросАсинх(НСтр("ru = 'Документы не будут созданы , если по договору были созданы документы вручную. 
       				              |Продолжить?'"), РежимДиалогаВопрос.ДаНет);

	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;

	Если Не КонтрольЗаполненияФОрмы() Тогда
		Возврат;
	КонецЕсли;
	ВыполнитьДлительнуюОперацию();
КонецПроцедуры

&НаКлиенте
Процедура Тест(Команда)
	ТестНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьДлительнуюОперацию() Экспорт

	ДлительнаяОперация = ВыполнитьДлительнуюОперациюНаСервере();
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);

	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении);

КонецПроцедуры
&НаСервере
Функция ВыполнитьДлительнуюОперациюНаСервере()
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор,
		"Обработки.ВКМ_МассовоеСозданиеАктов.ТяжелаяОперация", Объект.МесяцОтчета);
	Возврат ДлительнаяОперация;

КонецФункции
&НаСервере
Процедура ТестНаСервере()
	СтруктураДанных = Обработки.ВКМ_МассовоеСозданиеАктов.ТяжелаяОперация(Объект.МесяцОтчета);
	ЗаполнитьТаблицуОбработки(СтруктураДанных);
КонецПроцедуры
&НаСервере
Процедура ОповещениеОЗавершении(Результат, ДполнительныеПарметры) Экспорт

	Если Результат.Статус = "Выполнено" Тогда
		Результат = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		Если ТипЗнч(Результат) = Тип("Массив") Тогда
			ЗаполнитьТаблицуОбработки(Результат);
		ИначеЕсли ТипЗнч(Результат) = Тип("Строка") Тогда
			ОбщегоНазначения.СообщитьПользователю(Результат);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуОбработки(МассивДанных)
	Объект.Акты.Очистить();
	Для Каждого Стр Из МассивДанных Цикл
		НоваяСтрокаТЧ = Объект.Акты.Добавить();
		НоваяСтрокаТЧ.Документ = Стр.Договор;
		НоваяСтрокаТЧ.РеализацияТоваровУслуг = Стр.Ссылка;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти