

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Год = Формат(Объект.Год, "ДФ='ММММ гггг'");  
		
	ЦветАвто = Элементы.ОтпускаСотрудников.ЦветТекста; 
	
	Если Объект.ОтпускаСотрудников.Количество() > 0 Тогда
		Для Каждого Строка ИЗ Объект.ОтпускаСотрудников Цикл
			Дата1 = НачалоДня(Строка.ДатаОкончания); 
			Дата2 = НачалоДня(Строка.ДатаНачала);
			РазницаДаты = (Дата1 - Дата2) / (60 * 60 * 24);
			Если РазницаДаты > 28 Тогда 
				ДобавитьУсловноеОформление(РазницаДаты);
			КонецЕсли;
		КонецЦикла; 
			 	
	КонецЕсли; 
		
КонецПроцедуры

Процедура ДобавитьУсловноеОформление(РазницаДаты)
	
	ЭлементОформленияКрасный = УсловноеОформление.Элементы.Добавить();
	ЭлементОформленияКрасный.Использование = Истина;
	ЭлементОформленияКрасный.Оформление.УстановитьЗначениеПараметра("ЦветФона",  WebЦвета.Красный);
	
	ЭлементУсловияКрасный                = ЭлементОформленияКрасный.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловияКрасный.ЛевоеЗначение = РазницаДаты;
	ЭлементУсловияКрасный.ПравоеЗначение = 28; 
	ЭлементУсловияКрасный.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
	ЭлементУсловияКрасный.Использование  = Истина;
	
	ОформляемоеПоле      = ЭлементОформленияКрасный.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудников"); 
	//
	//ЭлементОформленияГолубой = УсловноеОформление.Элементы.Добавить();
	//ЭлементОформленияГолубой.Использование = Истина;
	//ЭлементОформленияГолубой.Оформление.УстановитьЗначениеПараметра("ЦветФона",  WebЦвета.Голубой);
	//
	//ЭлементУсловияГолубой                = ЭлементОформленияГолубой.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементУсловияГолубой.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.ТестоваяТЧ.СрокГодности");
	//ЭлементУсловияГолубой.ПравоеЗначение = ТекущаяДата(); 
	//ЭлементУсловияГолубой.ВидСравнения   = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	//ЭлементУсловияГолубой.Использование  = Истина;
	//
	//ОформляемоеПоле      = ЭлементОформленияГолубой.Поля.Элементы.Добавить();
	//ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТестоваяТЧ");
	
КонецПроцедуры


&НаКлиенте
Процедура ГодОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	
	Объект.Год = Формат(ВыбранноеЗначение, "ДФ='ММММ гггг'");
	
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьАнализГрафика(Команда)
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика"); 
	
КонецПроцедуры

