
Функция PingGETPing(Запрос)
	Возврат ВКМ_ТелеграмHTTP.ПростойУспешныйОтвет();
КонецФункции

Функция SendPOSTSend(Запрос)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачалоЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
	
	Попытка
		Ответ = ВКМ_ТелеграмHTTP.ПростойУспешныйОтвет();
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		Ответ = ВКМ_ТелеграмHTTP.ОтветОбОшибке(ИнформацияОбОшибке);
	КонецПопытки;
	
	ОценкаПроизводительности.ЗакончитьЗамерВремениТехнологический("bots.send", НачалоЗамера);
	
	ВКМ_ТелеграмHTTP.ЗаписьЛога("send", Запрос, Ответ);

	Возврат Ответ;
	
КонецФункции

