#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	// регистр ВКМ_ВыполненныеКлиентуРаботы
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;	
	
	// регистр ВКМ_ВыполненныеСотрудникомРаботы
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Дата КАК ДатаПроведенияРабот,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВидДоговора КАК ВидДоговора,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ДатаНачалаДействияДоговора КАК НачалоДоговора,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ДатаОкончанияДействияДоговора КАК КонецДоговора,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЗаЧас,
		|	ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы.(
		|		ЧасыКОплатеКлиенту КАК ЧасыКОплатеКлиенту
		|	) КАК ЧасыДляОплаты,
		|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудников.ПроцентОтРабот, 404) КАК ПроцентОтРабот
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников КАК ВКМ_УсловияОплатыСотрудников
		|		ПО ВКМ_ОбслуживаниеКлиента.Специалист = ВКМ_УсловияОплатыСотрудников.Сотрудник
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
		|	И ВКМ_УсловияОплатыСотрудников.Период = &Дата";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);   
	Запрос.УстановитьПараметр("Дата", НачалоМесяца(Дата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	НулеваяДата = Дата(01,01,0001,0,0,0);
			
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
	НачалоДоговора = НачалоДня(ВыборкаДетальныеЗаписи.НачалоДоговора);
	ДеньПроведенияРабот = НачалоДня(ВыборкаДетальныеЗаписи.ДатаПроведенияРабот);
	ОкончаниеДоговора = КонецДня(ВыборкаДетальныеЗаписи.КонецДоговора);
	
	ВремяНачалаДоговора = НачалоДоговора - НулеваяДата; 
	ВремяПроведенияРабот = ДеньПроведенияРабот - НулеваяДата;
	ВремяОкончанияДоговора = ОкончаниеДоговора - НулеваяДата;
		Если ВыборкаДетальныеЗаписи.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание 
			И ВремяНачалаДоговора <= ВремяПроведенияРабот
			И ВремяПроведенияРабот <= ВремяОкончанияДоговора Тогда		
			Выборка = ВыборкаДетальныеЗаписи.ЧасыДляОплаты.Выбрать();
			СтоимостьЗаЧас = ВыборкаДетальныеЗаписи.СтоимостьЗаЧас;
			ПроцентОтРабот = ВыборкаДетальныеЗаписи.ПроцентОтРабот;
			Пока Выборка.Следующий() Цикл
				// регистр ВКМ_ВыполненныеКлиентуРаботы
				ДвижениеВыполненныеКлиентуРаботы = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
				ДвижениеВыполненныеКлиентуРаботы.Период = Дата;
				ДвижениеВыполненныеКлиентуРаботы.ВидДвижения = ВидДвиженияНакопления.Приход;
				ДвижениеВыполненныеКлиентуРаботы.КлиентКонтрагент = КлиентКонтрагент;
				ДвижениеВыполненныеКлиентуРаботы.Договор = Договор;	
				ДвижениеВыполненныеКлиентуРаботы.КоличествоЧасов = Выборка.ЧасыКОплатеКлиенту;
				ДвижениеВыполненныеКлиентуРаботы.СуммаКОплате = Выборка.ЧасыКОплатеКлиенту * СтоимостьЗаЧас;	
				// регистр ВКМ_ВыполненныеСотрудникомРаботы
				Если ПроцентОтРабот = 404 Тогда
					Отказ = Истина;
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = СтрШаблон("На дату документа специалисту не установлен процент оплаты от работ. Документ не проведен.");
					Сообщение.Сообщить();
					Продолжить;
				КонецЕсли;
				ДвижениеВыполненныеСотрудникомРаботы = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();	
				ДвижениеВыполненныеСотрудникомРаботы.Период = Дата;
				ДвижениеВыполненныеСотрудникомРаботы.ВидДвижения = ВидДвиженияНакопления.Приход;
				ДвижениеВыполненныеСотрудникомРаботы.Сотрудник = Специалист;
				ДвижениеВыполненныеСотрудникомРаботы.ЧасовКОплате = Выборка.ЧасыКОплатеКлиенту;
				ДвижениеВыполненныеСотрудникомРаботы.СуммаКОплате = Выборка.ЧасыКОплатеКлиенту * СтоимостьЗаЧас * ПроцентОтРабот / 100;
			КонецЦикла;
			
		Иначе 
			
			Отказ = Истина;
			Если ВыборкаДетальныеЗаписи.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = СтрШаблон("Выбран вид договора не являющийся абонентским обслуживанием: %1.", ВыборкаДетальныеЗаписи.ВидДоговора);
				Сообщение.Сообщить();
			
			ИначеЕсли (ВремяПроведенияРабот <= ВремяНачалаДоговора ИЛИ
					ВремяОкончанияДоговора <= ВремяПроведенияРабот) Тогда
				
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = СтрШаблон("Дата проведения работ %1 не входит в период действия выбранного договора с %2 по %3.", 
				Формат(ВыборкаДетальныеЗаписи.ДатаПроведенияРабот, "ДФ=dd.MM.yyyy"),
				Формат(ВыборкаДетальныеЗаписи.НачалоДоговора, "ДФ=dd.MM.yyyy"), 
				Формат(ВыборкаДетальныеЗаписи.КонецДоговора, "ДФ=dd.MM.yyyy"));
				Сообщение.Сообщить();
			КонецЕсли; 
		КонецЕсли;
		
	Иначе
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = СтрШаблон("На дату документа специалисту не установлен процент оплаты от работ. Документ не проведен.");
		Сообщение.Сообщить();
	КонецЕсли;	
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

#КонецОбласти

#КонецЕсли
