#Область ПрограммныйИнтерфейс    

// Процедура "ДополнитьФорму"
//
// Описание:
//   Данная процедура предназначена для дополнения пользовательского интерфейса формы.
//   Она используется для добавления новых элементов управления, настройки их свойств
//   и размещения на форме.
//
// Параметры:
//   Форма - Форма
//     Ссылка на форму, которую необходимо дополнить.
//
// Пример использования:
//   ДополнитьФорму(ЭтаФорма);
Процедура ВКМ_ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ВКМ_ФормаЭлемента" Тогда
		ДобавитьПоляПериодДействияАбонентскуюПлатуИПочасовуюОплату(Форма);  
	КонецЕсли;
	
	Если ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьКнопкуЗаполнить(Форма);
	КонецЕсли;
	
	Если ИмяФормы = "Справочник.Пользователи.Форма.ФормаЭлемента" Тогда
		ДобавитьПолеПодразделение(Форма);  
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции  

Процедура ДобавитьПолеПодразделение(Форма)
	
	ГруппаДанныеШапки = Форма.Элементы.Найти("ГруппаДанныеШапки");
	ПолеВвода = Форма.Элементы.Добавить("ВКМ_КатегорияСотрудников", Тип("ПолеФормы"), ГруппаДанныеШапки);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.Видимость = Истина;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_КатегорияСотрудников";

КонецПроцедуры


Процедура ДобавитьПоляПериодДействияАбонентскуюПлатуИПочасовуюОплату(Форма)	
	
	ПолеВвода = Форма.Элементы.Добавить("ВКМ_ДатаНачалаДействияДоговора", Тип("ПолеФормы"));
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.Видимость = Ложь;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
	ПолеВвода = Форма.Элементы.Добавить("ВКМ_ДатаОкончанияДействияДоговора", Тип("ПолеФормы"));
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.Видимость = Ложь;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
	ПолеВвода = Форма.Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"));
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.Видимость = Ложь;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	ПолеВвода = Форма.Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"));
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.Видимость = Ложь;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";	
	
КонецПроцедуры


Процедура ДобавитьКнопкуЗаполнить(Форма);     
	
    НоваяКоманда = Форма.Команды.Добавить("ВКМ_Заполнить");                  
    НоваяКоманда.Действие = "ВКМ_ВызватьАвтозаполнение";
    НоваяКоманда.Заголовок = "Заполнить по данным Заявок"; 
	
    НоваяКнопка = Форма.Элементы.Добавить("ВКМ_Кнопка_Заполнить", Тип("КнопкаФормы"), Форма.Элементы.ФормаКоманднаяПанель);
    НоваяКнопка.ИмяКоманды = "ВКМ_Заполнить";  
    НоваяКнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка; 	
	
КонецПроцедуры


#КонецОбласти 
