
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//TODO: Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Документ.РеализацияТоваровУслуг.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	//КнопкаЗаполнить = ЭтаФорма.Элементы.Добавить("Заполнить1", Тип("КнопкаФормы"), ЭтаФорма.КоманднаяПанель);
	//КнопкаЗаполнить.Видимость = Истина;
	//КнопкаЗаполнить.Доступность = Истина;
	
	Команда = Команды.Добавить("Позвонить");
	Команда.Картинка = БиблиотекаКартинок.НачатьВидеоконференцию;
	Команда.Отображение = ОтображениеКнопки.Картинка;
	
КонецПроцедуры