
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   
	
	Диаграмма.Очистить();

	ТаблДанных = ПолучитьИзВременногоХранилища(Параметры.Адрес);
	
	Для Каждого Строка Из ТаблДанных Цикл
		
		Точка = Диаграмма.УстановитьТочку(Строка.Сотрудник);
		Серия = Диаграмма.УстановитьСерию(ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
		Значение = Диаграмма.ПолучитьЗначение(Точка,Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;    
		
		//@skip-check module-unused-local-variable
		//Шкала = Диаграмма.ОбластьПостроения.ШкалаВремени.Элементы[0];
		
	КонецЦикла;	
	
КонецПроцедуры  

#КонецОбласти



