
#Область СлужебныйПрограммныйИнтерфейс	

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	Функция СведенияОВнешнейОбработке() Экспорт
		ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.2.2.1");
		ПараметрыРегистрации.Информация = НСтр("ru = 'Обработка для отправки сообщений в Телеграмм из справочника по расписанию'");
		ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
		ПараметрыРегистрации.Версия = "1.0.0.1";
		ПараметрыРегистрации.БезопасныйРежим = Ложь;
		
		Команда = ПараметрыРегистрации.Команды.Добавить();
    	Команда.Представление = НСтр("ru = 'Параметры Отправки'");
    	Команда.Идентификатор = "ОтправкаСообщений";
    	Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
    	Команда.ПоказыватьОповещение = Истина;
		
		Команда = ПараметрыРегистрации.Команды.Добавить();
		Команда.Представление = НСтр("ru = 'Отправка сообщений в Телеграмм'");
		Команда.Идентификатор = "ОтправкаСообщенийВТелеграмм";
		Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
		Команда.ПоказыватьОповещение = Ложь;  
	
		Возврат ПараметрыРегистрации;
		
	КонецФункции

#КонецЕсли
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыВыполнения) Экспорт  
	
	ЗаписьЖурналаРегистрации("ОтправкаИзОбработкиВТелеграммВыполнитьКомандуИдентификаторКоманды", УровеньЖурналаРегистрации.Информация, , ,ИдентификаторКоманды);

	Если ИдентификаторКоманды <> "ОтправкаСообщенийВТелеграмм" Тогда                                                                                
		 ВызватьИсключение НСтр("ru = 'Неизвестный идентификатор команды'");
	КонецЕсли;

    ОтправитьСообщенияВТелеграм();

КонецПроцедуры


Процедура ОтправитьСообщенияВТелеграм() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_УведомленияТелеграмБотуДляОтправки.ТекстСообщения КАК ТекстСообщения,
		|	ВКМ_УведомленияТелеграмБотуДляОтправки.Ссылка КАК СсылкаНаУдаляемыйЭлементСправочникаСообщения
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграмБотуДляОтправки КАК ВКМ_УведомленияТелеграмБотуДляОтправки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КодСостояния = ВКМ_Телеграм.ОтправитьСообщениеВГруппуТелеграмм(ВыборкаДетальныеЗаписи.ТекстСообщения);
		Если КодСостояния = 200 Тогда 
			УдаляемыйЭлемент = ВыборкаДетальныеЗаписи.СсылкаНаУдаляемыйЭлементСправочникаСообщения.ПолучитьОбъект();
			УдаляемыйЭлемент.УстановитьПометкуУдаления(Истина);
			ЗаписьЖурналаРегистрации("ОтправкаСообщенийВТелеграммПоРасписанию", УровеньЖурналаРегистрации.Ошибка, , , КодСостояния);
		Иначе
			ЗаписьЖурналаРегистрации("ОтправкаСообщенийВТелеграммПоРасписанию", УровеньЖурналаРегистрации.Ошибка, , , КодСостояния);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры 
#КонецЕсли
#КонецОбласти

