

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПериодРегистрации = НачалоМесяца(Дата);
	
	СтавкаНДФЛ = Константы.ВКМ_СтавкаНДФЛ.Получить(); 
	СтавкаНДФЛ = (100 - СтавкаНДФЛ) / 100;
	
	Движения.ДополнительныеНачисления.Записывать = Истина; 
	Для Каждого Строка Из СписокСотрудников Цикл
		Движение = Движения.ДополнительныеНачисления.Добавить(); 
		ЗаполнитьЗначенияСвойств(Движение, Строка);
		Движение.СуммаПремии = Строка.СуммаПремии * СтавкаНДФЛ; 
		Движение.ПериодРегистрации = ПериодРегистрации; 
	КонецЦикла;
	
	Движения.Записать();
	
	Движения.ВзаиморасчетыССотрудниками.Записывать = Истина; 
	Для Каждого Строка Из СписокСотрудников Цикл
		Движение = Движения.ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;  
		Движение.Сотрудник = Строка.Сотрудник; 
		Движение.Сумма = ПолучитьСуммуПремии(Строка.Сотрудник, ПериодРегистрации);
		Движение.Период = ПериодРегистрации; 
	КонецЦикла;
	
	Движения.ВзаиморасчетыССотрудниками.Записать(); 
	
КонецПроцедуры

Функция ПолучитьСуммуПремии(Сотрудник, ПериодРегистрации)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДополнительныеНачисления.СуммаПремии КАК СуммаПремии
		|ИЗ
		|	РегистрРасчета.ДополнительныеНачисления КАК ДополнительныеНачисления
		|ГДЕ
		|	ДополнительныеНачисления.ПериодРегистрации = &ПериодРегистрации
		|	И ДополнительныеНачисления.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.СуммаПремии;  
	КонецЦикла;	
	
КонецФункции


