#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ВыполнитьОбработку(); 
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = "Обработка завершена";
	Сообщение.Сообщить();  
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьОбработку()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнитьГрафик(Период.ДатаНачала, Период.ДатаОкончания, ВыходныеДни, ГрафикРаботы);

КонецПроцедуры

#КонецОбласти

