
&НаКлиенте
Процедура РегламентВРучную(Команда)
	РегламентВРучнуюНаСервере();
КонецПроцедуры

&НаСервере
Процедура РегламентВРучнуюНаСервере()
	ВКМ_Телеграмм.РегламентОтправкаОповещенийВТелеграмм();
КонецПроцедуры

#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы //<ИмяТаблицыФормы>

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
