#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтправитьСообщение(Команда)  	
	ОтправитьСообщениеВГруппуТелеграмм(СообщениеВТелеграмм);
КонецПроцедуры


&НаКлиенте
Процедура ОтправитьСообщенияСправочника(Команда)
	ОтправитьСообщенияСправочникаНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтправитьСообщениеВГруппуТелеграмм(СообщениеВТелеграмм)
		
	ТокенУправленияТелеграмБотом = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить(); // "7918837962:AAETWQf4HLtgJbLh0lbBYG58cVHhWwJ6gg"; //
	ИдентификаторГруппыДляОповещения = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить(); // "-1002512859880"; //
	Ресурс = СтрШаблон("bot%1/sendMessage?chat_id=%2&text=%3", ТокенУправленияТелеграмБотом, ИдентификаторГруппыДляОповещения, СообщениеВТелеграмм);	
	Хост = "api.telegram.org";
	
	SSL = Новый ЗащищенноеСоединениеOpenSSL();
	HTTPСоединение = Новый HTTPСоединение(Хост,,,,,,SSL);
	HTTPЗапрос = Новый HTTPЗапрос(Ресурс);
	HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос); 
	
	Если HTTPОтвет.КодСостояния <> 200 Тогда
		Ответ = HTTPОтвет.ПолучитьТелоКакСтроку(); 
		ИмяСобытия = НСтр("ru = 'Сообщение в группу Телеграмм. Сообщение не отправлено'");
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, Ответ);		
	КонецЕсли;

КонецПроцедуры  


&НаСервере
Процедура ОтправитьСообщенияСправочникаНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_УведомленияТелеграмБотуДляОтправки.ТекстСообщения КАК ТекстСообщения,
		|	ВКМ_УведомленияТелеграмБотуДляОтправки.Ссылка КАК СсылкаНаУдаляемыйЭлементСправочникаСообщения
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграмБотуДляОтправки КАК ВКМ_УведомленияТелеграмБотуДляОтправки
		|ГДЕ
		|	ВКМ_УведомленияТелеграмБотуДляОтправки.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КодСостояния = ВКМ_Телеграм.ОтправитьСообщениеВГруппуТелеграмм(ВыборкаДетальныеЗаписи.ТекстСообщения);
		Если КодСостояния = 200 Тогда 
			УдаляемыйЭлемент = ВыборкаДетальныеЗаписи.СсылкаНаУдаляемыйЭлементСправочникаСообщения.ПолучитьОбъект();
			УдаляемыйЭлемент.УстановитьПометкуУдаления(Истина);
			ЗаписьЖурналаРегистрации("ОтправкаСообщенийВТелеграммПоРасписанию", УровеньЖурналаРегистрации.Ошибка, , , КодСостояния);
		Иначе
			ЗаписьЖурналаРегистрации("ОтправкаСообщенийВТелеграммПоРасписанию", УровеньЖурналаРегистрации.Ошибка, , , КодСостояния);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти
