
&НаСервере
Процедура СформироватьНаСервере()
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник,
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала,
	|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания
	|ИЗ
	|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников");
		
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	ДиаграммаГанта = ЭтотОбъект.ДиаграммаГанта;
	
	Пока Выборка.Следующий() Цикл

		ТочкаСотрудник = ДиаграммаГанта.УстановитьТочку(Выборка.Сотрудник);

		Точка = ТочкаСотрудник.Точки.Добавить();
		Точка.Текст = "Сотрудник";
		
		Серия = ДиаграммаГанта.УстановитьСерию("Показатель");
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		
		Значение = ДиаграммаГанта.ПолучитьЗначение(Точка, Серия);
		
		Интервал = Значение.Добавить();
		Интервал.Начало = Выборка.ДатаНачала;
		Интервал.Конец = Выборка.ДатаОкончания;
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры





