#Область ПрограммныйИнтерфейс

// Выводит дополнительные реквизиты на форму.
// Для вызова из обработчика формы ПриСозданииНаСервере.
Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьКнопкуЗаполнитьДокументРеализацияТоваровУслуг(Форма);	
	КонецЕсли;
	
КонецПроцедуры

// Возвращает вид договора.
// Возвращаемое значение:
// ПеречислениеСсылка.ВидыДоговоровКонтрагентов
Функция ПолучитьВидДоговора(Договор) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.ВидДоговора
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Договор);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ВидДоговора;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьКнопкуЗаполнитьДокументРеализацияТоваровУслуг(Форма) 
	
	КомандаЗаполнить = Форма.Команды.Добавить("КомандаЗаполнить"); 
	КомандаЗаполнить.Заголовок = "Заполнить";
	КомандаЗаполнить.Действие = "Заполнить";
	
	ЭлементЗаполнить = Форма.Элементы.Добавить("КомандаЗаполнить", Тип("КнопкаФормы"), Форма.Элементы.Услуги.КоманднаяПанель);
	ЭлементЗаполнить.ИмяКоманды = "КомандаЗаполнить";
	ЭлементЗаполнить.Вид = ВидКнопкиФормы.ОбычнаяКнопка; 
	
	МассивОтбора = Новый Массив;
	МассивОтбора.Добавить(Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание);
	МассивОтбора.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Покупатель);
	
	ЭлементДоговор = Форма.Элементы.Договор;
	ПараметрыВыбора = Новый Массив;
	ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговора", МассивОтбора));
	ЭлементДоговор.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);;
	
КонецПроцедуры

#КонецОбласти