#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)   
	
	// регистр ВКМ_ПлановыеОтпуска
	Движения.ВКМ_ПлановыеОтпуска.Записывать = Истина;
	Для Каждого ТекСтрокаОтпускаСотрудников Из ОтпускаСотрудников Цикл
		Движение = Движения.ВКМ_ПлановыеОтпуска.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаОтпускаСотрудников.Сотрудник;
		Движение.ДатаНачалаОтпуска = ТекСтрокаОтпускаСотрудников.ДатаНачала;
		Движение.ОтпускПлан = (ТекСтрокаОтпускаСотрудников.ДатаОкончания-ТекСтрокаОтпускаСотрудников.ДатаНачала+86400)/86400;
	КонецЦикла;

КонецПроцедуры  

#КонецОбласти

#КонецЕсли

