
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// регистр ВКМ_ПланОтпусков
	Движения.ВКМ_ПланОтпусков.Записывать = Истина;
	Для Каждого ТекСтрока Из ВКМ_ОтпускаСотрудников Цикл
		Движение = Движения.ВКМ_ПланОтпусков.Добавить();
		Движение.Период = Дата;
		Движение.ВКМ_Сотрудник = ТекСтрока.ВКМ_Сотрудник;
		Движение.ВКМ_ДатаНачала = ТекСтрока.ВКМ_ДатаНачала;
		Движение.ВКМ_ДатаОкончания = ТекСтрока.ВКМ_ДатаОкончания;
		ДнейОтпуска = (ТекСтрока.ВКМ_ДатаОкончания - ТекСтрока.ВКМ_ДатаНачала) /86400 + 1;
		Движение.ВКМ_ДнейОтпуска = ДнейОтпуска;
	КонецЦикла; 

КонецПроцедуры 


#КонецОбласти

#КонецЕсли
