
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВКМ_Заполнить(Команда)
	
	ВКМ_ЗаполнитьНаСервере();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВКМ_ЗаполнитьНаСервере() 
	
	Объект.ВКМ_Выплаты.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_ВзаиморасчетыССотрудникамиОстатки.ВКМ_Сотрудник КАК Сотрудник,
	               |	СУММА(ВКМ_ВзаиморасчетыССотрудникамиОстатки.ВКМ_СуммаОстаток) СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВКМ_ВзаиморасчетыССотрудникамиОстатки.ВКМ_Сотрудник"; 
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.ВКМ_Выплаты.Добавить();
		НоваяСтрока.ВКМ_Сотрудник = Выборка.Сотрудник; 
		НоваяСтрока.ВКМ_Сумма = Выборка.СуммаОстаток;
	КонецЦикла;	
	
КонецПроцедуры


#КонецОбласти
