

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ПериодРегистрации = НачалоМесяца(Дата);
	
	Движения.ВКМ_ОсновныеНачисления.Записывать = Истина; 
	Для Каждого Строка Из СписокСотрудников Цикл
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить(); 
		ЗаполнитьЗначенияСвойств(Движение, Строка); 
		Движение.ПериодДействияНачало = Строка.ДатаНачала; 
		Движение.ПериодДействияКонец = КонецДня(Строка.ДатаОкончания);
		Движение.ПериодРегистрации = ПериодРегистрации; 
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать();
	
	Движения.ВКМ_Удержания.Записывать = Истина; 
	Для Каждого Строка Из Удержания Цикл
		Движение = Движения.ВКМ_Удержания.Добавить(); 
		ЗаполнитьЗначенияСвойств(Движение, Строка);
		Движение.ПериодРегистрации = ПериодРегистрации; 
	КонецЦикла;
	
	Движения.ВКМ_Удержания.Записать();
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсновныеНачисленияДанныеГрафика.Сотрудник КАК Сотрудник,
		|	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.КоличествоДнейПериодДействия, 0) КАК КоличествоДней,
		|	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.КоличествоДнейФактическийПериодДействия, 0) КАК КоличествоДнейОтработано,
		|	ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки
		|ПОМЕСТИТЬ ВТ_ДанныеГрафика
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(Регистратор = &Регистратор) КАК ОсновныеНачисленияДанныеГрафика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеГрафика.КоличествоДней КАК КоличествоДней,
		|	ВТ_ДанныеГрафика.КоличествоДнейОтработано КАК КоличествоДнейОтработано,
		|	УсловияОплатыСотрудниковСрезПоследних.Оклад КАК Оклад,
		|	УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот,
		|	ВТ_ДанныеГрафика.НомерСтроки КАК НомерСтроки,
		|	ВТ_ДанныеГрафика.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТ_ДанныеОклада
		|ИЗ
		|	ВТ_ДанныеГрафика КАК ВТ_ДанныеГрафика
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&ПериодРегистрации, ) КАК УсловияОплатыСотрудниковСрезПоследних
		|		ПО ВТ_ДанныеГрафика.Сотрудник = УсловияОплатыСотрудниковСрезПоследних.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеОклада.КоличествоДней КАК КоличествоДней,
		|	ВТ_ДанныеОклада.КоличествоДнейОтработано КАК КоличествоДнейОтработано,
		|	ВТ_ДанныеОклада.Оклад КАК Оклад,
		|	ВТ_ДанныеОклада.ПроцентОтРабот КАК ПроцентОтРабот,
		|	ВТ_ДанныеОклада.НомерСтроки КАК НомерСтроки,
		|	ВКМ_ВыполненныеСотрудникомРаботыОстатки.СуммаКОплатеОстаток КАК СуммаКОплатеПроцент,
		|	ВТ_ДанныеОклада.Сотрудник КАК Сотрудник
		|ИЗ
		|	ВТ_ДанныеОклада КАК ВТ_ДанныеОклада
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Остатки КАК ВКМ_ВыполненныеСотрудникомРаботыОстатки
		|		ПО ВТ_ДанныеОклада.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботыОстатки.Сотрудник";
	
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	СтавкаНДФЛ = Константы.ВКМ_СтавкаНДФЛ.Получить();
	СтавкаНДФЛ = (100 - СтавкаНДФЛ) / 100;
	
	Для каждого Движение Из Движения.ВКМ_ОсновныеНачисления Цикл
		Выборка.Сбросить(); 
		Выборка.НайтиСледующий(Движение.НомерСтроки, "НомерСтроки");
			
		Если Выборка.КоличествоДней <> 0 Тогда 
			Движение.Результат = Выборка.Оклад / Выборка.КоличествоДней * Выборка.КоличествоДнейОтработано * СтавкаНДФЛ; 	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Выборка.СуммаКОплатеПроцент) Тогда 
			Движение.Результат = Выборка.Оклад / Выборка.КоличествоДней * Выборка.КоличествоДнейОтработано;
			Движение.Результат = (Движение.Результат + Выборка.СуммаКОплатеПроцент) * СтавкаНДФЛ; 
		КонецЕсли; 
		
	КонецЦикла; 
		
    Движения.ВКМ_ОсновныеНачисления.Записать(, Истина); 
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина; 
	Для Каждого Строка Из СписокСотрудников Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;  
		Движение.Сотрудник = Строка.Сотрудник; 
		Движение.Сумма = ПолучитьСуммуОклада(Строка.Сотрудник, ПериодРегистрации);
		Движение.Период = ПериодРегистрации; 
	КонецЦикла;
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать(); 
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина; 
	Для Каждого Строка Из Удержания Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;  
		Движение.Сотрудник = Строка.Сотрудник; 
		Движение.Сумма = Строка.СуммаУдержания;
		Движение.Период = ПериодРегистрации;
	КонецЦикла;   
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();	
	
КонецПроцедуры

Функция ПолучитьСуммуОклада(Сотрудник, ПериодРегистрации)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсновныеНачисления.Результат КАК Результат
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ОсновныеНачисления
		|ГДЕ
		|	ОсновныеНачисления.ПериодРегистрации = &ПериодРегистрации
		|	И ОсновныеНачисления.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("ПериодРегистрации", ПериодРегистрации);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Результат;  
	КонецЦикла;	
	
КонецФункции

