#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ПревышениеОтпуска();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПревышениеОтпуска();

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	ПревышениеОтпуска();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковСотрудникПриИзменении(Элемент)
	ПревышениеОтпуска();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	ПревышениеОтпуска();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьАнализГрафика(Команда) 
    Адрес = ПоместитьВХранилище();
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Адрес", Адрес);
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, Элементы.ОтпускаСотрудников,);
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПоместитьВХранилище() 
	ТабЗначений = Объект.ОтпускаСотрудников.Выгрузить(); 
	Адрес = ПоместитьВоВременноеХранилище(ТабЗначений);
Возврат Адрес
КонецФункции

 		
   &НаСервере
Процедура ПревышениеОтпуска() 
    ТабЗ  = Объект.ОтпускаСотрудников.Выгрузить();
   
	Запрос = Новый Запрос;
    Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
    
    Запрос.Текст = "ВЫБРАТЬ * ПОМЕСТИТЬ ТЗ ИЗ &ТЗ КАК ТЗ";
    Запрос.УстановитьПараметр("ТЗ", ТабЗ);
    Запрос.Выполнить();
      
		Запрос = Новый Запрос;
	 Запрос.Текст =
	 	"ВЫБРАТЬ
	 	|	РАЗНОСТЬДАТ(ТЗ.ДатаНачала, ТЗ.ДатаОкончания, День) КАК ДнейОтпуска,
	 	|	ТЗ.Сотрудник
	 	|ПОМЕСТИТЬ ВременнаяТаблица1
	 	|ИЗ
	 	|	&ТЗ КАК ТЗ
	 	|;
	 	|
	 	|////////////////////////////////////////////////////////////////////////////////
	 	|ВЫБРАТЬ
	 	|	ВременнаяТаблица1.Сотрудник,
	 	|	СУММА(ВременнаяТаблица1.ДнейОтпуска) КАК ДнейОтпуска
	 	|ИЗ
	 	|	ВременнаяТаблица1 КАК ВременнаяТаблица1
	 	|СГРУППИРОВАТЬ ПО
	 	|	ВременнаяТаблица1.Сотрудник";
	
		 Запрос.УстановитьПараметр("ТЗ", ТабЗ );
	 
	 РезультатЗапроса = Новый Массив;
	 Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.ДнейОтпуска > 28 Тогда
			РезультатЗапроса.Добавить(Выборка.Сотрудник);
			КонецЕсли;	
		КонецЦикла;
	
	
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
	     Строка.ПревышениеОтпуска = Ложь;
		Для Каждого Сотрудник Из РезультатЗапроса Цикл
			Если Строка.Сотрудник = Сотрудник Тогда
			 Строка.ПревышениеОтпуска = Истина;
		КонецЕсли;	
		КонецЦикла;	
	КонецЦикла;
КонецПроцедуры
#КонецОбласти

