#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
		Строка.РазностьДатВДнях = (Строка.ДатаОкончания - Строка.ДатаНачала) / 86400;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
        Объект.УстановитьСсылкуНового(Документы.ВКМ_ГрафикОтпусков.ПолучитьСсылку(Новый УникальныйИдентификатор));
    КонецЕсли;
	
	Адрес = ПоместитьВоВременноеХранилищеНаСервере();
	
	ПараметрыФормы = Новый Структура("Адрес", Адрес);
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ПоместитьВоВременноеХранилищеНаСервере()

    Структура = Новый Структура();
    //реквизиты     
    Структура.Вставить("Год", Объект.Год);
    
    //таблица     
    Структура.Вставить("ОтпускаСотрудников", Объект.ОтпускаСотрудников.Выгрузить());
    
    Адрес = ПоместитьВоВременноеХранилище(Структура, Новый УникальныйИдентификатор);
    Возврат Адрес;
    
КонецФункции

#КонецОбласти

#КонецЕсли
