#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

Функция Списокреализаций(Знач ДатаНачала, Знач ДатаОкончания) Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание)
	|	И ДоговорыКонтрагентов.ВКМ_НачалоДействия = &НачалоДействия
	|	И ДоговорыКонтрагентов.ВКМ_КонецДействия = &КонецДействия
	|	И НЕ ДоговорыКонтрагентов.Ссылка В
	|		(ВЫБРАТЬ
	|			РеализацияТоваровУслуг.Договор.Ссылка
	|		ИЗ
	|			Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг)";
	
	Запрос.УстановитьПараметр("НачалоДействия",ДатаНачала);
    Запрос.УстановитьПараметр("КонецДействия",ДатаОкончания);
    РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	РеализацииМассив = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		РеализацииСтруктура = Новый Структура; 
        Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Реализация) Тогда  
         	НоваяРеализация = СоздатьНовуюРеализацию(ВыборкаДетальныеЗаписи.Договор, ДатаОкончания); 
			РеализацииСтруктура.Вставить("Договор", ВыборкаДетальныеЗаписи.Договор); 
			РеализацииСтруктура.Вставить("Реализация", НоваяРеализация);
        Иначе 
			РеализацииСтруктура.Вставить("Договор", ВыборкаДетальныеЗаписи.Договор); 
			РеализацииСтруктура.Вставить("Реализация", ВыборкаДетальныеЗаписи.Реализация);	
		КонецЕсли; 
		РеализацииМассив.Добавить(РеализацииСтруктура); 
	КонецЦикла; 
	
	Возврат РеализацииМассив; 
		
КонецФункции

Функция СоздатьНовуюРеализацию(Договор, ДатаСозданияНовойРеализации) Экспорт
	
	НоваяРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент(); 
	НоваяРеализация.ВыполнитьАвтозаполнение(Договор.Ссылка); 
	НоваяРеализация.Дата = ДатаСозданияНовойРеализации; 
	НоваяРеализация.Ответственный = Пользователи.ТекущийПользователь();
	НоваяРеализация.Договор = Договор; 
	НоваяРеализация.Контрагент = Договор.Владелец; 
	НоваяРеализация.Организация = Договор.Организация;    
	
	НачатьТранзакцию(); 
	
	Если НоваяРеализация.ПроверитьЗаполнение() Тогда
		Попытка
			НоваяРеализация.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный); 
        	ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ОбщегоНазначения.СообщитьПользователю("Не удалось провести документ"); 
			ЗаписьЖурналаРегистрации("ОБРАБОТКА: Массовое создание актов. Отмена проведения"); 
		КонецПопытки;
	Иначе 
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не удалось создать реализацию по Договору: %1. Не все обязательные данные заполнены", Договор)); 
	КонецЕсли;
	
	Возврат НоваяРеализация.Ссылка;    
	
КонецФункции

#КонецОбласти

#КонецЕсли