#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	Отбор = Новый Структура;
	Отбор.Вставить("ВидРасчета", ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия);
	
	СтрокаФиксированнойПремии = СписокСотрудников.НайтиСтроки(Отбор);    
	
	Если СтрокаФиксированнойПремии.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Это документ для начисления фиксированной премии.";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Сотрудник КАК Сотрудник,
		|	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.ВидРасчета КАК ВидРасчета,
		|	СУММА(ВКМ_НачислениеФиксированнойПремииСписокСотрудников.СуммаПремии) КАК СуммаПремии
		|ПОМЕСТИТЬ ВТ_ТабличнаяЧасть
		|ИЗ
		|	Документ.ВКМ_НачислениеФиксированнойПремии.СписокСотрудников КАК ВКМ_НачислениеФиксированнойПремииСписокСотрудников
		|
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.Сотрудник,
		|	ВКМ_НачислениеФиксированнойПремииСписокСотрудников.ВидРасчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Пользователи.ВКМ_КатегорияСотрудников КАК КатегорияСотрудников,
		|	Пользователи.Ссылка КАК Сотрудник,
		|	ВТ_ТабличнаяЧасть.ВидРасчета КАК ВидРасчета,
		|	ВТ_ТабличнаяЧасть.СуммаПремии КАК СуммаПремии
		|ИЗ
		|	ВТ_ТабличнаяЧасть КАК ВТ_ТабличнаяЧасть
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО ВТ_ТабличнаяЧасть.Сотрудник = Пользователи.Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;  
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;  
	Движения.ВКМ_Удержания.Записывать = Истина;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		// регистр ВКМ_ДополнительныеНачисления
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ВидРасчета = ВидРассчета;
		Движение.ПериодРегистрации = Дата;
		Движение.ПериодДействияНачало = НачалоМесяца(Дата);
		Движение.ПериодДействияКонец = КонецМесяца(Дата);
		Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		Движение.Результат = ВыборкаДетальныеЗаписи.СуммаПремии;
		Движение.КатегорияСотрудников = ВыборкаДетальныеЗаписи.КатегорияСотрудников;
		
		// регистр ВКМ_ВзаиморасчетыССотрудниками Расход
		ДвижениеРасчеты = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		ДвижениеРасчеты.ВидДвижения = ВидДвиженияНакопления.Расход;
		ДвижениеРасчеты.Период = Дата; 
		ДвижениеРасчеты.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник; 
		ДвижениеРасчеты.Сумма = ВыборкаДетальныеЗаписи.СуммаПремии;   
		
		// регистр ВКМ_Удержания
		ДвиженияУдержанияНДФЛ = Движения.ВКМ_Удержания.Добавить();
		ДвиженияУдержанияНДФЛ.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;  
		ДвиженияУдержанияНДФЛ.ПериодРегистрации = Дата;      
		ДвиженияУдержанияНДФЛ.ПериодДействияНачало = НачалоМесяца(Дата);
		ДвиженияУдержанияНДФЛ.ПериодДействияКонец = КонецМесяца(Дата);
		ДвиженияУдержанияНДФЛ.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		ДвиженияУдержанияНДФЛ.КатегорияСотрудников = ВыборкаДетальныеЗаписи.КатегорияСотрудников;
		ДвиженияУдержанияНДФЛ.Результат = Окр(ВыборкаДетальныеЗаписи.СуммаПремии / 100 * 13);
		
		// регистр ВКМ_ВзаиморасчетыССотрудниками Прихлж
		ДвижениеРасчетыНДФЛ = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		ДвижениеРасчетыНДФЛ.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеРасчетыНДФЛ.Период = Дата; 
		ДвижениеРасчетыНДФЛ.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник; 
		ДвижениеРасчетыНДФЛ.Сумма = ДвиженияУдержанияНДФЛ.Результат; 
	
	КонецЦикла;
	
	Движения.ВКМ_ДополнительныеНачисления.Записать();
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();     
	Движения.ВКМ_Удержания.Записать();
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!
	//
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

#КонецОбласти

#КонецЕсли

