#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Адрес") Тогда
		
		//@skip-check unknown-form-parameter-access
		Адрес = Параметры.Адрес;

	КонецЕсли;
	
	ЗаполнениеГрафикаНаСервере(Адрес);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнениеГрафикаНаСервере(Адрес)
    Результат = ПолучитьИзВременногоХранилища(Адрес);  
	Год = Результат.Год;
	ОтпускаСотрудников = Результат.ОтпускаСотрудников;

 	Серия = ДГ.УстановитьСерию("Отпуска");
 	Для Каждого Строка Из ОтпускаСотрудников Цикл
		Точка = ДГ.УстановитьТочку(Строка.Сотрудник);
		Значение = ДГ.ПолучитьЗначение(Точка, Серия);
		//Пример заполнения вспомогательного реквизита
		Интервал = Значение.Добавить();
		Интервал.Начало = Строка.ДатаНачала;
		Интервал.Конец = Строка.ДатаОкончания;
	КонецЦикла;
 
КонецПроцедуры

#КонецОбласти

#КонецЕсли

