#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда   
    
#Область ОбработчикиСобытий
  
Процедура ОбработкаПроведения(Отказ, Режим)     
    
    Если НЕ ЗначениеЗаполнено(Выплаты) Тогда
    
    	 ОбщегоНазначения.СообщитьПользователю("Не заполнено ни одной строчки"); 
         Отказ = Истина; 
         
    КонецЕсли;
    
    
    Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
    Для Каждого ТекСтрокаВыплаты Из Выплаты Цикл
        Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
        Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
        Движение.Период = Дата;
        Движение.Сотрудник = ТекСтрокаВыплаты.Сотрудник;
        Движение.Подразделение = ТекСтрокаВыплаты.Подразделение;
        Движение.Сумма = ТекСтрокаВыплаты.Сумма;
    КонецЦикла;

КонецПроцедуры  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

 Процедура Автозаполнение() Экспорт
 
 	Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |   ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
        |   ВКМ_ВзаиморасчетыССотрудникамиОстатки.Подразделение КАК Подразделение,
        |   ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК СуммаОстаток
        |ИЗ
        |   РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки";
    
    РезультатЗапроса = Запрос.Выполнить();    
    
    Если РезультатЗапроса.Пустой() Тогда
    
    	 ОбщегоНазначения.СообщитьПользователю("Всё выплачено!"); 
         Возврат; 
    КонецЕсли;
    
    Выборка = РезультатЗапроса.Выбрать(); 
    
     Пока Выборка.Следующий() Цикл
        
        Строка = Выплаты.Добавить();        
		Строка.Сотрудник = Выборка.Сотрудник; 
        Строка.Подразделение = Выборка.Подразделение; 
        Строка.Сумма = Выборка.СуммаОстаток; 
        
    КонецЦикла;
 
КонецПроцедуры   

#КонецОбласти

#КонецЕсли

