
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Движения.ВКМ_Удержания.Записывать = Истина;
	Для Каждого ТекСтрокаСписокСотрудников Из СписокСотрудников Цикл
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.Премия;
		Движение.ПериодРегистрации = Дата;
		Движение.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
		Движение.Результат = ТекСтрокаСписокСотрудников.СуммаПремии;
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец = КонецМесяца(Дата);
		Движение.ОтработаноЧасов = 0;
	
	//Удержание
		ДвижениеНДФЛ = Движения.ВКМ_Удержания.Добавить();
		ДвижениеНДФЛ.ПериодРегистрации = Дата;
		ДвижениеНДФЛ.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		ДвижениеНДФЛ.Сотрудник = Движение.Сотрудник;
		ДвижениеНДФЛ.Результат = Движение.Результат * 13 / 100;	
	КонецЦикла;	
	
	СформироватьДвижениеВзаиморасчетыССотрудниками();
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвижениеВзаиморасчетыССотрудниками()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисления.Сотрудник,
	|	ВКМ_ОсновныеНачисления.Результат КАК ОсновныеНачисления,
	|	0 КАК ДополнительныеНачисления,
	|	0 КАК Удержание,
	|	ВКМ_ОсновныеНачисления.Регистратор
	|ПОМЕСТИТЬ ВТ_ДвижениеПоРегистру
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
	|ГДЕ
	|	ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВКМ_ДополнительныеНачисления.Сотрудник,
	|	0,
	|	ВКМ_ДополнительныеНачисления.Результат,
	|	0,
	|	ВКМ_ДополнительныеНачисления.Регистратор
	|ИЗ
	|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
	|ГДЕ
	|	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВКМ_Удержания.Сотрудник,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(ВКМ_Удержания.Результат),
	|	ВКМ_Удержания.Регистратор
	|ИЗ
	|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
	|ГДЕ
	|	ВКМ_Удержания.Регистратор = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_Удержания.Сотрудник,
	|	ВКМ_Удержания.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДвижениеПоРегистру.Регистратор,
	|	ВТ_ДвижениеПоРегистру.Сотрудник,
	|	СУММА(ВТ_ДвижениеПоРегистру.ОсновныеНачисления) КАК ОсновныеНачисления,
	|	СУММА(ВТ_ДвижениеПоРегистру.ДополнительныеНачисления) КАК ДополнительныеНачисления,
	|	СУММА(ВТ_ДвижениеПоРегистру.Удержание) КАК Удержание
	|ИЗ
	|	ВТ_ДвижениеПоРегистру КАК ВТ_ДвижениеПоРегистру
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДвижениеПоРегистру.Регистратор,
	|	ВТ_ДвижениеПоРегистру.Сотрудник";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	НаборЗаписейВзаиморасчетыССотрудниками = РегистрыНакопления.ВКМ_ВзаиморасчетыССотрудниками.СоздатьНаборЗаписей();
	НаборЗаписейВзаиморасчетыССотрудниками.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписейВзаиморасчетыССотрудниками.Прочитать();
	НаборЗаписейВзаиморасчетыССотрудниками.Очистить();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

		Запись = НаборЗаписейВзаиморасчетыССотрудниками.ДобавитьПриход();
		ЗаполнитьЗначенияСвойств(Запись, ВыборкаДетальныеЗаписи);
		Запись.Период = Дата;
		Запись.Сумма = ВыборкаДетальныеЗаписи.ОсновныеНачисления + ВыборкаДетальныеЗаписи.ДополнительныеНачисления
			- ВыборкаДетальныеЗаписи.Удержание;

	КонецЦикла;
	НаборЗаписейВзаиморасчетыССотрудниками.Записать();

КонецПроцедуры

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
