
Процедура ОбработкаПроведения(Отказ, Режим)
	
	НачалоПериода = НачалоМесяца(Дата);
	КонецПериода = КонецМесяца(Дата); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВзаиморасчетыССотрудникамиОстаткиИОбороты.СуммаКонечныйОстаток КАК Сумма,
		|	ВзаиморасчетыССотрудникамиОстаткиИОбороты.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, , , ) КАК ВзаиморасчетыССотрудникамиОстаткиИОбороты";
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ТЗ = РезультатЗапроса.Выгрузить(); 
		
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Для Каждого Строка Из Выплаты Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Сотрудник = Строка.Сотрудник;
		СтрокаИзТЗ = ТЗ.Найти(Строка.Сотрудник, "Сотрудник");
		Движение.Сумма = СтрокаИзТЗ.Сумма; 
	КонецЦикла;
	
	Движения.Записать();

КонецПроцедуры
