#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОтправитьСообщения(Команда)
	Оповещение = Новый ОписаниеОповещения("ОтправитьСообщенияПодтверждение",
      ЭтотОбъект);	              
    ПоказатьВопрос(Оповещение,
        "Отправить сообщения в Telegram?",
        РежимДиалогаВопрос.ДаНет,0,, 
        "Подтвереждение действия" ); 
КонецПроцедуры
#КонецОбласти 

#Область ВспомогательныеПодпрограммы
&НаСервере
Процедура ОтправитьСообщенияНаСервере()

	ВКМ_РеглЗаданиеДляОтправкиСообщений.ВКМ_ОтправкаСообщенийВТелеграм(Истина);

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщенияПодтверждение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ОтправитьСообщенияНаСервере();	
	
КонецПроцедуры	
#КонецОбласти 