#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьГрафик(Команда)
	ВыполнитьОбработку();
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Обработка завершена!";
	Сообщение.Сообщить();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьОбработку()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    ОбработкаОбъект.ЗаполнитьГрафик(ВыборПериода.ДатаНачала, ВыборПериода.ДатаОкончания, ВыходныеДни, ГрафикРаботы);
КонецПроцедуры 

#КонецОбласти
