
Функция СозданиеРеализаций(ДанныеСтруктуры, МассивДанных) Экспорт
	
	ЕстьРеализации = ПроверитьРеализациюНаПериод(МассивДанных[0].Период);
	Если ЕстьРеализации Тогда
		Сообщить("Уже созданы реализации за этот период"); 
		Возврат Ложь; 	
	КонецЕсли; 
	
	Если МассивДанных[1].Количество() > 0 Тогда 
		Для Каждого Строка Из МассивДанных[1] Цикл
			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			НовыйДокумент.Дата = МассивДанных[0].Период;
			НовыйДокумент.Контрагент = Строка.Договор.Владелец;
			НовыйДокумент.Договор = Строка.Договор; 
			ЗаполнитьЗначенияСвойств(НовыйДокумент, Строка.Договор);
			НовыйДокумент.ВыполнитьАвтозаполнение(НовыйДокумент);
			НаличиеОшибок = НовыйДокумент.ПроверитьЗаполнение();
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);			 
		КонецЦикла; 
	КонецЕсли;
	
КонецФункции	

Функция ПроверитьРеализациюНаПериод(Период) 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	НЕ РеализацияТоваровУслуг.ПометкаУдаления
		|	И РеализацияТоваровУслуг.Дата = &Дата";
	
	Запрос.УстановитьПараметр("Дата", Период);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Истина; 
	Иначе 
		Возврат Ложь; 
	КонецЕсли;
		
КонецФункции
