#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СозданиеЭлементов();
	ВидимостьЭлементов(Ложь);	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		
		ВидимостьЭлементов(Истина);
	
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти 


#Область ОбработчикиСобытийЭлементовШапкиФормы
 

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		
		ВидимостьЭлементов(Истина);
		
	Иначе
		
		ВидимостьЭлементов(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СозданиеЭлементов()

	ГруппаПериодДействия = Элементы.Добавить("ГруппаДатаДействия",Тип("ГруппаФормы"), ЭтотОбъект);
	ГруппаПериодДействия.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПериодДействия.ОтображатьЗаголовок = Ложь;
	ГруппаПериодДействия.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	
	ЭлементНачалоДействия = Элементы.Добавить("НачалоДействия", Тип("ПолеФормы"), ГруппаПериодДействия );
	ЭлементНачалоДействия.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементНачалоДействия.ПутьКДанным = "Объект.ВКМ_НачалоДействия";
	
	
	ЭлементКонецДействия = Элементы.Добавить("КонецДействия", Тип("ПолеФормы"), ГруппаПериодДействия );
	ЭлементКонецДействия.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементКонецДействия.ПутьКДанным = "Объект.ВКМ_КонецДействия";
	
	ЭлементАбонентскаяПлата = Элементы.Добавить("АбонентскаяПлата", Тип("ПолеФормы"), ЭтотОбъект );
	ЭлементАбонентскаяПлата.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементАбонентскаяПлата.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";
	
	СтоимостьЧасаРаботы = Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"), ЭтотОбъект );
	СтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода;
	СтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
		
КонецПроцедуры

&НаСервере
Процедура ВидимостьЭлементов(Значение)
	
	Элементы.ГруппаДатаДействия.Видимость = Значение;
	Элементы.НачалоДействия.Видимость = Значение;
	Элементы.КонецДействия.Видимость = Значение;
	Элементы.АбонентскаяПлата.Видимость = Значение;
	Элементы.СтоимостьЧасаРаботы.Видимость = Значение;	
	
КонецПроцедуры;




#КонецОбласти 




