
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВключитьВидимостьАбонентскогоДоговора()
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВключитьВидимостьАбонентскогоДоговора()
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВключитьВидимостьАбонентскогоДоговора()
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание") Тогда
		Элементы.ВКМ_ДанныеАбонентскогоДоговора.Видимость = Истина;
	Иначе
		Элементы.ВКМ_ДанныеАбонентскогоДоговора.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти