#Область ОбработчикиСобытийФормы

//@skip-check module-structure-form-event-regions
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтоДоговорАбоненскгоОбслуживания = 0;
	
	УказанныйВидДоговораАбоненскоеОбслуживание = ЗапросВидаДоговора(ЭтоДоговорАбоненскгоОбслуживания);

	Если УказанныйВидДоговораАбоненскоеОбслуживание = 1 Тогда
		ВключитьВидимость();
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	АбонентскоеОбслуживание = ЭтоАбонентскоеОбслудивание(Объект.ВидДоговора);
	Если АбонентскоеОбслуживание И Не ЗначениеЗаполнено(Объект.ВКМ_СуммаАбонентскойПлаты) Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Поле 'Сумма абонентской платы' должно быть заполнено.";
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)  
	Если Элемент.ВыделенныйТекст <> "Абонентское обслуживание" Тогда
		ОтключитьВидимость();
	Иначе
		ВключитьВидимость();
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура ОтключитьВидимость()
	Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость = Ложь; 
	Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость = Ложь;  
	Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
	Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;	
КонецПроцедуры  
&НаКлиенте
Процедура ВключитьВидимость()
	Элементы.ВКМ_ДатаНачалаДействияДоговора.Видимость = Истина; 
	Элементы.ВКМ_ДатаОкончанияДействияДоговора.Видимость = Истина;  
	Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
	Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
КонецПроцедуры 

&НаСервере
Функция ЗапросВидаДоговора(ЭтоДоговорАбоненскоеОбслуживания)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		УказанныйВидДоговора = ВыборкаДетальныеЗаписи.ВидДоговора;
	КонецЦикла;
	
	Если УказанныйВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		ЭтоДоговорАбоненскгоОбслуживания = 1;
	КонецЕсли;
	
	Возврат ЭтоДоговорАбоненскгоОбслуживания;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЭтоАбонентскоеОбслудивание(АбонентскоеОбслуживание)
	ЭтоАбонентскоеОбслудивание = Ложь;
	Если АбонентскоеОбслуживание = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		ЭтоАбонентскоеОбслудивание = Истина;	
	КонецЕсли;
	Возврат ЭтоАбонентскоеОбслудивание;
КонецФункции
#КонецОбласти
