
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВключитьВидимостьПриАбонентскойПлате();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийэлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВключитьВидимостьПриАбонентскойПлате();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВключитьВидимостьПриАбонентскойПлате()
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание") Тогда
		Элементы.ВКМ_РеквизитыАбонентскогоДоговора.Видимость = Истина;
	Иначе
		Элементы.ВКМ_РеквизитыАбонентскогоДоговора.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти