#Область СлужебныеПроцедурыИФункции
Процедура ЗаписатьСообщениеВЖурнал(ТекстСообщения, ТипСообщение = "Ошибка") Экспорт
	
	СтруктураСобытий = Новый Структура("ИмяСобытия, ПредставлениеУровня, Комментарий, ДатаСобытия");					
	СтруктураСобытий.ИмяСобытия 		 = "Ошибка проверки заполнения";
	
	СтруктураСобытий.ПредставлениеУровня = ТипСообщение;	//"Информация", "Ошибка", "Предупреждение", "Примечание".
	СтруктураСобытий.Комментарий 		 = ТекстСообщения;
	//СтруктураСобытий.ДатаСобытия 		 = ТекущаяДатаСеанса();
	
	СобытияДляЖурналаРегистрации = Новый СписокЗначений();
	СобытияДляЖурналаРегистрации.Добавить(СтруктураСобытий);
	
	ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СобытияДляЖурналаРегистрации);	
						
КонецПроцедуры

#КонецОбласти