
Процедура ПриЗаписи(Отказ)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Дата КАК Дата,
		|	ВКМ_ОбслуживаниеКлиента.ВКМ_Специалист КАК Специалист
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.Дата < ТекущаяДата() Тогда
		
			НовыйЭлемент = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
			НовыйЭлемент.Документ = Ссылка;
			НовыйЭлемент.ВремяИзменения = ТекущаяДата();
			НовыйЭлемент.ТекстСообщения = "Документ " + Ссылка + " изменен в " + ТекущаяДата();
			НовыйЭлемент.Записать();
			
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.Дата = ТекущаяДата() Тогда
		
			НовыйЭлемент = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
			НовыйЭлемент.Документ = Ссылка;
			НовыйЭлемент.ВремяИзменения = ТекущаяДата();
			НовыйЭлемент.ТекстСообщения = "Создан новый документ " + Ссылка + " изменен в " + ТекущаяДата();
			НовыйЭлемент.Записать();
			
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры



Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// регистр ВКМ_ВыполненныеКлиентуРаботы 
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
		|	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора КАК ВКМ_ДатаНачалаДействияДоговора,
		|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора КАК ВКМ_ДатаОкончанияДействияДоговора,
		|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК ВКМ_СтоимостьЧасаРаботы
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ВКМ_Договор);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ВКМ_ДатаНачалаДействияДоговора) И 
	 		 ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ВКМ_ДатаОкончанияДействияДоговора) И
			 	(Дата < ВыборкаДетальныеЗаписи.ВКМ_ДатаНачалаДействияДоговора ИЛИ
					Дата > ВыборкаДетальныеЗаписи.ВКМ_ДатаОкончанияДействияДоговора) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Дата документа выходит за рамки действия договора";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		
		СтавкаЧасаКлиента = ВыборкаДетальныеЗаписи.ВКМ_СтоимостьЧасаРаботы;
		
	КонецЦикла;
	
	ПроцентОтРабот = ПолучитьПроцентОплаты(ВКМ_Специалист);
	Если ПроцентОтРабот = Неопределено Тогда 
		Отказ = Истина; 	
	КонецЕсли;
	
	

	Для Каждого ТекСтрокаСписокРабот Из ВКМ_ВыполненныеРаботы Цикл
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Договор = ВКМ_Договор;
		Движение.Период = Дата;
		Движение.Клиент = ВКМ_Клиент;
		Движение.КоличествоЧасов = ТекСтрокаСписокРабот.ВКМ_ФактическиПотраченоЧасов;
		Движение.СуммаКОплате = ТекСтрокаСписокРабот.ВКМ_ЧасыКОплатеКлиенту;
		
		Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Сотрудник = ВКМ_Специалист;
		Движение.Период = Дата;
		Движение.ЧасовКОплате = ТекСтрокаСписокРабот.ВКМ_ФактическиПотраченоЧасов;
		Движение.СуммаКОплате = (ТекСтрокаСписокРабот.ВКМ_ЧасыКОплатеКлиенту * СтавкаЧасаКлиента * ПроцентОтРабот) / 100;

	КонецЦикла;
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
	
КонецПроцедуры 

Функция ПолучитьПроцентОплаты(Сотрудник)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних КАК УсловияОплатыСотрудниковСрезПоследних
		|ГДЕ
		|	УсловияОплатыСотрудниковСрезПоследних.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(); 
	
	Если Выборка.Следующий() Тогда
		Если НЕ ЗначениеЗаполнено(Выборка.ПроцентОтРабот) Тогда
			Возврат 1;
		Иначе Возврат Выборка.ПроцентОтРабот;
		КонецЕсли;
	Иначе
		Возврат Неопределено; 
	КонецЕсли;
	
КонецФункции




Процедура ЗапускФункцииОтправки(Текст) Экспорт
	
	РезультатОтправки = ВКМ_ТелеграмHTTP.ОтправкаСообщенияВТелеграм(Текст);
		
КонецПроцедуры