#Область ПрограммныйИнтерфейс    

Функция ПеребратьЭлементыСпрУведомления() Экспорт  
	
		Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_УведомленияТелеграмБоту.Представление КАК Сообщение,
		|	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту
		|ГДЕ
		|	ВКМ_УведомленияТелеграмБоту.ПометкаУдаления = Ложь";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Ссылка = ВыборкаДетальныеЗаписи.Ссылка;   
		ТекстСообщения = ВыборкаДетальныеЗаписи.Ссылка.ТекстСообщения;
		
		ОтправитьСообщение(ТекстСообщения); 
		
		ЭлементНаУдаление = Ссылка.ПолучитьОбъект();
		ЭлементНаУдаление.ПометкаУдаления = Истина;
		ЭлементНаУдаление.Записать();
	КонецЦикла;
	
КонецФункции

Функция ОтправитьСообщение (Сообщение)  Экспорт       
	
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(); 
	
	ТокенТелеграм = Константы.ВКМ_ТокенТелеграмБота.Получить();  
	ИдентификаторЧата = Константы.ВКМ_ИдентификаторГруппыТелеграм.Получить();  
	ТекстСообщения = Сообщение; 
	
	Запрос = Новый HTTPЗапрос;
	Запрос.Заголовки.Вставить("Content-Type", "application/json");
	СтрокаЗапроса = "/bot" + ТокенТелеграм + "/sendMessage?chat_id=" + СтрЗаменить(Формат(ИдентификаторЧата, "ЧДЦ=; ЧС=; ЧРГ=."), ".", "") 
	+ "&text= " + ТекстСообщения;
	
	Запрос.АдресРесурса = (СтрокаЗапроса) ; 
	Соединение = Новый HTTPСоединение("api.telegram.org",443,,,,,ЗащищенноеСоединение);
	
	РезультатЗапроса = Соединение.Получить(Запрос); 
	
	Если РезультатЗапроса.КодСостояния = 200 Тогда 
		Результат = РезультатЗапроса.ПОлучитьТелоКакСтроку();
	КонецЕсли;       
	
	Возврат Результат;
		
КонецФункции  

#КонецОбласти
	
