#Область ПрограммныйИнтерфейс
// Отправить сообщение в Телеграмм
// Параметры: 
//   Текст - текст сообщения
Функция ТелеграмОтправитьСообщение(Текст) Экспорт
	
	Соединение = Новый HTTPСоединение("api.telegram.org", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL());
	
	Данные = Новый структура;
	Данные.Вставить("chat_id",Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить());
	Данные.Вставить("text",Текст);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Данные);
	СтрокаЗапроса = ЗаписьJSON.Закрыть();
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("content-type", "application/json");
	ЗапросPOST = Новый HTTPЗапрос(СтрШаблон("bot%1/sendMessage",
	                                        Константы.ВКМ_ТокенУправленияТелеграм.Получить()), 
	                              Заголовки);
	ЗапросPOST.УстановитьТелоИзСтроки(СтрокаЗапроса);
	HTTPОтвет = Соединение.ОтправитьДляОбработки(ЗапросPOST);
	//ОтветСервиса = HTTPОтвет.ПолучитьТелоКакСтроку();	
	
	Возврат HTTPОтвет.КодСостояния;
					
КонецФункции
#КонецОбласти