
Функция SendPOSTSend(Запрос)
	УстановитьПривилегированныйРежим(Истина);
    
    НачалоЗамера = ОценкаПроизводительности.НачатьЗамерВремени(); 
    
    
	Попытка   
		Ответ = ВКМ_Телеграмм.ПростойУспешныйОтвет();
		 
	Исключение   
		ИнформацияОбОшибке = ИнформацияОбОшибке(); 
		Ответ =  ВКМ_Телеграмм.ОтветОбОшибке(ИнформацияОбОшибке); 
    КонецПопытки;	
    
    ОценкаПроизводительности.ЗакончитьЗамерВремениТехнологический("bots.send", НачалоЗамера); 
    
    ВКМ_Телеграмм.ЗаписьЛога("send", Запрос, Ответ); 
    
	Возврат  Ответ;
КонецФункции

Функция PingGETPing(Запрос)
	
	Возврат ВКМ_Телеграмм.ПростойУспешныйОтвет();
	
КонецФункции
