//НачалоДоработки. Контеева, 25.06.24.   

//Выплата з/п
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	
	Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
		// регистр ВКМ_ВзаиморасчетыССотрудниками Расход
		Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
		Для Каждого ТекСтрокаВыплаты Из Выплаты Цикл
			Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Сотрудник = ТекСтрокаВыплаты.Сотрудник;
			Движение.Сумма = ТекСтрокаВыплаты.Сумма;
		КонецЦикла;      
		
	КонецПроцедуры
	
	#КонецОбласти
	
	#Область СлужебныеПроцедурыИФункции
	
	Процедура ОчисткаРегистра() Экспорт
		
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Очистить();
    Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина; 
    Движения.ВКМ_ВзаиморасчетыССотрудниками.Записать();
		
	КонецПроцедуры
	
	#КонецОбласти

#КонецЕсли

//Конец доработки