
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ВКМ_РасчитатьДниОтпуска();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ВКМ_РасчитатьДниОтпуска();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВКМ_ОтпускаСотрудников

&НаКлиенте
Процедура ВКМ_ОтпускаСотрудниковПриИзменении(Элемент)

	ВКМ_РасчитатьДниОтпуска();		

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВКМ_АнализГрафика(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ВКМ_Год) Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите год, за который нужен график");
		Возврат;
	КонецЕсли;
		
	Адрес = ВКМ_ПоместитьВоВременноеХранилищеНаСервере();
	ПараметрыФормы = Новый Структура("Адрес", Адрес);
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ФормаАнализГрафика", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВКМ_РасчитатьДниОтпуска()
	
	Для Каждого Строка Из Объект.ВКМ_ОтпускаСотрудников Цикл
		Строка.ВКМ_ДнейОтпуска = (КонецДня(Строка.ВКМ_ДатаОкончания) + 1 - НачалоДня(Строка.ВКМ_ДатаНачала)) / 86400
КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ВКМ_ПоместитьВоВременноеХранилищеНаСервере()

	Адрес = ПоместитьВоВременноеХранилище(Объект.ВКМ_ОтпускаСотрудников.Выгрузить( ,
		"ВКМ_Сотрудник,ВКМ_ДатаНачала,ВКМ_ДатаОкончания"), УникальныйИдентификатор);
	Возврат Адрес;

КонецФункции


#КонецОбласти
